# Pandas 활용하기
* 데이터 분석에 특화된 데이터구조를 제공하는 라이브러리(테이블 형태의 DataFrame,리스트 형태의 Series)
* 다양한 데이터 분석 함수 제공
* 데이터베이스에서 쉽게 자료를 가져올 수 있음
* json, csv, excel, html의 table 요소 등 다양한 데이터를 불러올 수 있음
* numpy를 내부적으로 사용, numpy와 pandas간 변환이 쉬움
* https://pandas.pydata.org/

# Pandas 에서 다루는 데이터 타입 2가지
## 1) Dataframe: 2차원 형태의 표형식 데이터
* python의 dict를 기반으로 만들어진 데이터. 하나의 key에 리스트 자료가 value로 들어간 형태
* {key1:[value1,value2,value3], key2:[value1,value2,value3]}
* key는 데이터프레임의 컬럼명, value는 컬럼의 자료
* 데이터프레임은 python의 dict 사용법과 거의 비슷

## 2) Series: 1차원 형태의 벡터형식 데이터
* python의 list, tuple, ndarray의 1차원 상태와 비슷
* 이름이 있는 list
* list 사용법과 비슷, 인덱싱, 슬라이싱 가능, 반복문 사용 가능

In [1]:
import pandas as pd

# 데이터 프레임 만들기
pd.DataFrame({key1:[value1,value2,value3], key2:[value1,value2,value3]})

In [2]:
df=pd.DataFrame(
    {'이름':['홍길동','둘리','또치','도우너'],'주소':['서울','의정부','고양시','성남시'],'취미':['음악감상','놀기','달리기','바이올린']}
)

In [3]:
df

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치  고양시   달리기
3  도우너  성남시  바이올린

# 넘파이 기반으로 만들어졌기 때문에 넘파이 메서드 사용 가능

In [4]:
df.shape

(4, 3)

In [5]:
df.ndim

2

In [7]:
arr=df.to_numpy()
arr

array([['홍길동', '서울', '음악감상'],
       ['둘리', '의정부', '놀기'],
       ['또치', '고양시', '달리기'],
       ['도우너', '성남시', '바이올린']], dtype=object)

In [10]:
pd.DataFrame(arr,columns=df.columns)

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치  고양시   달리기
3  도우너  성남시  바이올린

# 데이터 프레임 슬라이싱, .loc(인덱스명, 컬럼이름), .iloc(행인덱스,열인덱스)

In [14]:
df.iloc[:2,:2]

    이름   주소
0  홍길동   서울
1   둘리  의정부

# 데이터 프레임에서 컬럼 1개만 출력할 때
변수명[컬럼명])

In [20]:
list(df['이름'])

['홍길동', '둘리', '또치', '도우너']

In [17]:
d={'이름':['홍길동','둘리','또치','도우너'],'주소':['서울','의정부','고양시','성남시'],'취미':['음악감상','놀기','달리기','바이올린']}
d

{'이름': ['홍길동', '둘리', '또치', '도우너'],
 '주소': ['서울', '의정부', '고양시', '성남시'],
 '취미': ['음악감상', '놀기', '달리기', '바이올린']}

In [19]:
d['이름']

['홍길동', '둘리', '또치', '도우너']

In [21]:
df['이름']

0    홍길동
1     둘리
2     또치
3    도우너
Name: 이름, dtype: object

In [22]:
for name in df['이름']:
    print(name)

홍길동
둘리
또치
도우너

In [25]:
df['이름'][1]

'둘리'

# 컬럼을 2개 이상 잘라 오고 싶을 때

In [26]:
df[['이름','취미']]

    이름    취미
0  홍길동  음악감상
1   둘리    놀기
2   또치   달리기
3  도우너  바이올린

# 컬럼 순서를 바꾸고 싶을 때

In [28]:
df[['취미','이름','주소']]

     취미   이름   주소
0  음악감상  홍길동   서울
1    놀기   둘리  의정부
2   달리기   또치  고양시
3  바이올린  도우너  성남시

# Series  만들기
* pd.Series([리스트/튜플],name="컬럼명")
* 이름을 가지고 있는 list/벡터
* DataFrame에서 컬럼 1개를 잘라온 형태

In [29]:
ages=pd.Series([22,33,53],name='나이')
ages

0    22
1    33
2    53
Name: 나이, dtype: int64

In [30]:
ages.dtype

dtype('int64')

In [31]:
ages.shape

(3,)

In [32]:
ages.ndim

1

In [34]:
ages[1:3]

1    33
2    53
Name: 나이, dtype: int64

In [35]:
ages[::-1]

2    53
1    33
0    22
Name: 나이, dtype: int64

In [36]:
ages.min()

np.int64(22)

In [37]:
ages.max()

np.int64(53)

In [38]:
ages.sum()

np.int64(108)

In [39]:
ages.cumsum()

0     22
1     55
2    108
Name: 나이, dtype: int64

In [41]:
ages.median()

np.float64(33.0)

In [42]:
ages.mean()

np.float64(36.0)

# Pandas에서 자료 불러오기, 저장하기
* csv, tsv, excel, json, html, sql
* pd.read_확장자명(파일경로, 옵션)

# excel 파일 불러오기
* xls, xlsx 두가지 파일 형식이 있음
* excel 파일을 불러올 때는 openpyxl 라이브러리를 따로 설치
```
!pip install openpyxl
```

In [43]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

excel 파일은 loading시간이 오래 걸림

In [44]:
%%time
df_excel = pd.read_excel("./data/Online Retail.xlsx")
df_excel

CPU times: total: 1min 17s
Wall time: 1min 17s

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [52]:
df_excel2=pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx")
df_excel2

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\openpyxl\styles\stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,□ 본 서비스에서 제공하는 정보는 법적인 효력이 없으므로 참고용으로만 활용하시기 바랍니다.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20
0,"□ 신고정보가 실시간 변경, 해제되어 제공시점에 따라 공개건수 및 내용이 상이할 수...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"□ 본 자료는 계약일 기준입니다. (※ 7월 계약, 8월 신고건 → 7월 거래건으로...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"□ 통계자료 활용시에는 수치가 왜곡될 수 있으니 참고자료로만 활용하시기 바라며, ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,* 국토교통부 실거래가 공개시스템의 궁금하신 점이나 문의사항은 콜센터 1533-29...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37587,37576,서울특별시 송파구 장지동,849,0849,0000,송파파인타운3단지,84.9800,202407,01,"117,500",...,14,개인,개인,2008,충민로 152,-,중개거래,서울 송파구,-,아파트
37588,37577,부산광역시 사상구 모라동,552,0552,0000,백양그린,41.3000,202407,01,"7,000",...,8,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.10,아파트
37589,37578,광주광역시 광산구 비아동,152-5,0152,0005,호반,59.8800,202407,01,"15,400",...,5,개인,개인,1998,비아로 185,-,중개거래,광주 광산구,24.07.26,아파트
37590,37579,부산광역시 사상구 모라동,552,0552,0000,백양그린,41.3000,202407,01,"7,500",...,10,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.19,아파트
37591,37580,대구광역시 북구 읍내동,1366-2,1366,0002,칠곡보성,84.9800,202407,01,"21,000",...,9,개인,개인,1992,구암로21길 26,-,중개거래,대구 북구,-,아파트

In [51]:
df_excel2=pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx",header=12)
df_excel2

,NO,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),...,층,매수자,매도자,건축년도,도로명,해제사유발생일,거래유형,중개사소재지,등기일자,주택유형
0,1,서울특별시 영등포구 당산동5가,42,42,0,당산삼성래미안4차,115.7800,202407,31,"139,000",...,4,개인,개인,2003,당산로 214,-,직거래,-,-,아파트
1,2,강원특별자치도 원주시 지정면 가곡리,1512,1512,0,원주롯데캐슬골드파크1차(5단지),84.9644,202407,31,"38,900",...,10,개인,개인,2019,신지정로 250,20240802,중개거래,강원 원주시,-,아파트
2,3,대구광역시 달성군 화원읍 구라리,1650,1650,0,대곡역래미안,84.5958,202407,31,"29,500",...,11,개인,개인,2007,비슬로539길 35,-,중개거래,대구 달성군,-,아파트
3,4,광주광역시 남구 진월동,312-7,312,7,광명,70.6250,202407,31,"16,900",...,1,개인,개인,1998,광복마을길 63,-,중개거래,광주 남구,-,아파트
4,5,광주광역시 남구 진월동,331-93,331,93,중흥,84.8400,202407,31,"17,500",...,13,개인,개인,1992,서문대로749번마길 30,-,직거래,-,24.07.31,아파트
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37575,37576,서울특별시 송파구 장지동,849,849,0,송파파인타운3단지,84.9800,202407,1,"117,500",...,14,개인,개인,2008,충민로 152,-,중개거래,서울 송파구,-,아파트
37576,37577,부산광역시 사상구 모라동,552,552,0,백양그린,41.3000,202407,1,"7,000",...,8,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.10,아파트
37577,37578,광주광역시 광산구 비아동,152-5,152,5,호반,59.8800,202407,1,"15,400",...,5,개인,개인,1998,비아로 185,-,중개거래,광주 광산구,24.07.26,아파트
37578,37579,부산광역시 사상구 모라동,552,552,0,백양그린,41.3000,202407,1,"7,500",...,10,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.19,아파트
37579,37580,대구광역시 북구 읍내동,1366-2,1366,2,칠곡보성,84.9800,202407,1,"21,000",...,9,개인,개인,1992,구암로21길 26,-,중개거래,대구 북구,-,아파트

# csv 파일 읽어오기( ,로 구분된 자료가 있는 파일)

csv파일이 훨씬 빠르기 때문에 엑셀파일 다른이름으로 저장 csv로 저장하면 빠름

In [46]:
%%time
df_csv=pd.read_csv("./data/Online Retail.csv")
df_csv

CPU times: total: 688 ms
Wall time: 675 ms

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [54]:
df_csv2=pd.read_csv("./data/아파트(매매)_실거래가_20240806113828.csv",header=12,usecols=[1,5,6,7,8,9])
df_csv2

                       시군구                단지명   전용면적(㎡)    계약년월  계약일 거래금액(만원)
0         서울특별시 영등포구 당산동5가          당산삼성래미안4차  115.7800  202407   31  139,000
1      강원특별자치도 원주시 지정면 가곡리  원주롯데캐슬골드파크1차(5단지)   84.9644  202407   31   38,900
2        대구광역시 달성군 화원읍 구라리             대곡역래미안   84.5958  202407   31   29,500
3             광주광역시 남구 진월동                 광명   70.6250  202407   31   16,900
4             광주광역시 남구 진월동                 중흥   84.8400  202407   31   17,500
...                    ...                ...       ...     ...  ...      ...
37575        서울특별시 송파구 장지동          송파파인타운3단지   84.9800  202407    1  117,500
37576        부산광역시 사상구 모라동               백양그린   41.3000  202407    1    7,000
37577        광주광역시 광산구 비아동                 호반   59.8800  202407    1   15,400
37578        부산광역시 사상구 모라동               백양그린   41.3000  202407    1    7,500
37579         대구광역시 북구 읍내동               칠곡보성   84.9800  202407    1   21,000

[37580 rows x 6 columns]

# json 파일 읽어오기

In [55]:
df_json=pd.read_json("./data/서울특별시_관광지입장정보_2011_2016.json")
df_json

    ForNum  NatNum  addrCd gungu      resNm  rnum   sido  yyyymm
0    44722   75991    1111   종로구        창덕궁     1  서울특별시  201112
1        0   11017    1111   종로구        운현궁     2  서울특별시  201112
2   132399  237330    1111   종로구        경복궁     3  서울특별시  201112
3     3133   21267    1111   종로구        창경궁     4  서울특별시  201112
4    18226   24223    1111   종로구         종묘     5  서울특별시  201112
..     ...     ...     ...   ...        ...   ...    ...     ...
62    5588   44232    1141  서대문구  서대문형무소역사관     8  서울특별시  201512
63       0   22587    1141  서대문구  서대문자연사박물관     9  서울특별시  201512
64   29520    8822    1144   마포구    트릭아이미술관    10  서울특별시  201512
65       3    1647    1165   서초구      헌릉ㆍ인릉    11  서울특별시  201512
66     492   14454    1168   강남구      선릉·정릉    12  서울특별시  201512

[67 rows x 8 columns]

# html에서 table 데이터 읽어오기

In [57]:
df_html=pd.read_html("./data/corpList.htm")
df_html[0]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,한국제15호스팩,금융 지원 서비스업,기업인수합병,2024-06-26,12월,유한,NaN,서울특별시
1,에스오에스랩,"측정, 시험, 항해, 제어 및 기타 정밀기기 제조업; 광학기기 제외",산업용 및 차량용 라이다(LiDAR),2024-06-25,12월,정지성,홈페이지 보기,광주광역시
2,미래에셋비전스팩6호,금융 지원 서비스업,기업인수합병,2024-06-24,12월,정명훈,NaN,서울특별시
3,에이치엠씨제7호스팩,금융 지원 서비스업,기타금융,2024-06-24,12월,강신명,NaN,서울특별시
4,파라다이스,유원지 및 기타 오락관련 서비스업,"카지노, 호텔, 복합리조트",2024-06-24,12월,최종환..,홈페이지 보기,서울특별시
5,한중엔시에스,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","수냉식 냉각시스템 ESS Parts, 공랭식 ESS Module Parts, EV ...",2024-06-24,12월,김환식,홈페이지 보기,경상북도
6,KB제29호스팩,금융 지원 서비스업,기업인수합병,2024-06-21,12월,서영화,NaN,서울특별시
7,미래에셋비전스팩5호,금융 지원 서비스업,기업인수합병,2024-06-19,12월,김대호,NaN,서울특별시
8,씨어스테크놀로지,의료용 기기 제조업,심전도검사솔루션 입원환자모니터링솔루션,2024-06-19,12월,이영신,홈페이지 보기,경기도
9,한국제14호스팩,금융 지원 서비스업,기업인수합병,2024-06-19,12월,변성환,NaN,서울특별시
10,디비금융스팩12호,기타 금융업,기업인수 및 합병,2024-06-18,12월,김창희,NaN,서울특별시
11,라메디텍,의료용 기기 제조업,초소형 레이저 의료기기 및 미용기기,2024-06-17,12월,최종석,NaN,서울특별시
12,그리드위즈,"그외 기타 전문, 과학 및 기술 서비스업","수요관리 서비스, 전기차 충전기 모뎀 등",2024-06-14,12월,김구환,홈페이지 보기,경기도
13,다원넥스뷰,사진장비 및 광학기기 제조업,LSMB(Laser Micro Bonding System),2024-06-11,12월,남기중,홈페이지 보기,경기도
14,미래에셋비전스팩4호,금융 지원 서비스업,기업인수목적회사(기타금융서비스),2024-05-29,12월,김정수,NaN,서울특별시

# DB에서 자료 읽어오기

In [1]:
from sqlalchemy import create_engine,text
import pymysql
pymysql.install_as_MySQLdb()

In [59]:
engine=create_engine("mysql+pymysql://root:?@localhost:?/ex_rate")
conn=engine.connect()
df_sql=pd.read_sql("ex_rate",con=conn)
conn.close()
df_sql

,날짜,통화,현찰_사실_때_환율,현찰_사실_때_Spread,현찰_파실_때_환율,현찰_파실_때_Spread,송금_보낼_때,송금_받을_때,외화_수표_파실때,매매_기준율,환가_료율,미화_환산율
0,2025-10-22,미국 USD,1465.50,1.75,1415.10,1.75,1454.40,1426.20,1423.86,1440.30,5.86524,1.0000
1,2025-10-22,일본 JPY (100),960.98,1.75,927.94,1.75,953.71,935.21,934.61,944.46,2.58682,0.6557
2,2025-10-22,유로 EUR,1703.11,1.99,1636.65,1.99,1686.57,1653.19,1651.40,1669.88,3.87900,1.1594
3,2025-10-22,중국 CNY,212.17,5.00,191.97,5.00,204.09,200.05,0.00,202.07,3.68591,0.1403
4,2025-10-22,홍콩 HKD,188.98,1.97,181.68,1.97,187.18,183.48,183.23,185.33,5.48866,0.1287
...,...,...,...,...,...,...,...,...,...,...,...,...
633,2025-10-29,리비아 LYD,0.00,0.00,0.00,0.00,264.75,258.49,0.00,261.62,2.97500,0.1839
634,2025-10-29,루마니아 RON,0.00,0.00,0.00,0.00,328.54,321.40,0.00,324.97,8.04833,0.2284
635,2025-10-29,미얀마 MMK,0.00,0.00,0.00,0.00,0.70,0.66,0.00,0.68,1.97500,0.0005
636,2025-10-29,에티오피아 ETB,0.00,0.00,0.00,0.00,9.37,9.15,0.00,9.26,2.97500,0.0065
637,2025-10-29,우즈베키스탄 UZS,0.00,0.00,0.00,0.00,0.13,0.11,0.00,0.12,17.47500,0.0001

In [59]:
engine=create_engine("mysql+pymysql://root:?@localhost:3306/ex_rate")
conn=engine.connect()
df_sql=pd.read_sql("ex_rate",con=conn)
conn.close()
df_sql

,날짜,통화,현찰_사실_때_환율,현찰_사실_때_Spread,현찰_파실_때_환율,현찰_파실_때_Spread,송금_보낼_때,송금_받을_때,외화_수표_파실때,매매_기준율,환가_료율,미화_환산율
0,2025-10-22,미국 USD,1465.50,1.75,1415.10,1.75,1454.40,1426.20,1423.86,1440.30,5.86524,1.0000
1,2025-10-22,일본 JPY (100),960.98,1.75,927.94,1.75,953.71,935.21,934.61,944.46,2.58682,0.6557
2,2025-10-22,유로 EUR,1703.11,1.99,1636.65,1.99,1686.57,1653.19,1651.40,1669.88,3.87900,1.1594
3,2025-10-22,중국 CNY,212.17,5.00,191.97,5.00,204.09,200.05,0.00,202.07,3.68591,0.1403
4,2025-10-22,홍콩 HKD,188.98,1.97,181.68,1.97,187.18,183.48,183.23,185.33,5.48866,0.1287
...,...,...,...,...,...,...,...,...,...,...,...,...
633,2025-10-29,리비아 LYD,0.00,0.00,0.00,0.00,264.75,258.49,0.00,261.62,2.97500,0.1839
634,2025-10-29,루마니아 RON,0.00,0.00,0.00,0.00,328.54,321.40,0.00,324.97,8.04833,0.2284
635,2025-10-29,미얀마 MMK,0.00,0.00,0.00,0.00,0.70,0.66,0.00,0.68,1.97500,0.0005
636,2025-10-29,에티오피아 ETB,0.00,0.00,0.00,0.00,9.37,9.15,0.00,9.26,2.97500,0.0065
637,2025-10-29,우즈베키스탄 UZS,0.00,0.00,0.00,0.00,0.13,0.11,0.00,0.12,17.47500,0.0001

In [2]:
df=pd.read_csv("./data/Titanic_train.csv")
df

NameError: name 'pd' is not defined

# 데이터의 일부만 보기 head(), tail()

기본은 5줄

In [61]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
df.head(60)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
44,45,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,330958,7.8792,NaN,Q
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
51,52,0,3,"Nosworthy, Mr. Richard Cater",male,21.0,0,0,A/4. 39886,7.8000,NaN,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0,1,0,2926,26.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
56,57,1,2,"Rugg, Miss. Emily",female,21.0,0,0,C.A. 31026,10.5000,NaN,S
57,58,0,3,"Novel, Mr. Mansouer",male,28.5,0,0,2697,7.2292,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.0,1,2,C.A. 34651,27.7500,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S

60개 이상부터는 증간에 생략(...)이 된다

In [67]:
df.head(70)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S
67,68,0,3,"Crease, Mr. Ernest James",male,19.0,0,0,S.P. 3464,8.1583,NaN,S
68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.0,4,2,3101281,7.9250,NaN,S
69,70,0,3,"Kink, Mr. Vincenz",male,26.0,2,0,315151,8.6625,NaN,S

In [68]:
df.tail(61)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
832,833,0,3,"Saad, Mr. Amin",male,NaN,0,0,2671,7.2292,NaN,C
833,834,0,3,"Augustsson, Mr. Albert",male,23.00,0,0,347468,7.8542,NaN,S
834,835,0,3,"Allum, Mr. Owen George",male,18.00,0,0,2223,8.3000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.00,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.00,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.00,0,0,370376,7.7500,NaN,Q

# 각 컬럼의 데이터 타입 .dtypes

In [69]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# 컬럼명, non이 아닌 데이터 수, 데이터 타입 .info
* 컬럼이 너무 많아서 Non-Null Count가 나오지 않을 때 옵션에 show_counts=True를 주면 보임

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 숫자로 된 자료의 기초 통계량을 보고 싶을 때 .describe()

data type이 int나 float일 때만 가능

In [72]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

int, float이 아닌 자료도 보고싶을 때

In [3]:
describe_result=df.describe(include="all")
describe_result

NameError: name 'df' is not defined

In [85]:
describe_result.loc["25%",:]

PassengerId     223.5
Survived          0.0
Pclass            2.0
Name              NaN
Sex               NaN
Age            20.125
SibSp             0.0
Parch             0.0
Ticket            NaN
Fare           7.9104
Cabin             NaN
Embarked          NaN
Name: 25%, dtype: object

# 데이터 프레임에서 일부 컬럼만 가져오기

## 1개 컬럼만 가져오는 경우

In [86]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

## 2개 이상의 컬럼을 가져오는 경우

In [87]:
df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

## 컬럼명 추출하기 .columns

In [89]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [90]:
df[['Name','Age','Pclass','Survived']]

                                                  Name   Age  Pclass  Survived
0                              Braund, Mr. Owen Harris  22.0       3         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                               Heikkinen, Miss. Laina  26.0       3         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                             Allen, Mr. William Henry  35.0       3         0
..                                                 ...   ...     ...       ...
886                              Montvila, Rev. Juozas  27.0       2         0
887                       Graham, Miss. Margaret Edith  19.0       1         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN       3         0
889                              Behr, Mr. Karl Howell  26.0       1         1
890                                Dooley, Mr. Patrick  32.0       3         0

[891 rows x 4 columns]

# loc, iloc를 사용해서 데이터 프레임 잘라오기
* loc: 데이터프레임의 인덱스명, 컬럼명으로 데이터의 일부를 추출
    * df.loc[시작row인덱스명, 끝row에 인덱스명,시작column의 clumn명 : 끝column의 컬럼명]
* iloc: 데이터프레임의 인덱스 번호, 컬럼의 인덱스 번호로 데이터의 일부를 추출
    * df.iloc[시작인덱스번호: 끝 인덱스 번호+1 : step,시작 column 인덱스 번호: 끝 column 인덱스 번호+1:step]

In [91]:
df.loc[0:10,['Name','Age','Pclass','Survived']]

                                                 Name   Age  Pclass  Survived
0                             Braund, Mr. Owen Harris  22.0       3         0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                              Heikkinen, Miss. Laina  26.0       3         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                            Allen, Mr. William Henry  35.0       3         0
5                                    Moran, Mr. James   NaN       3         0
6                             McCarthy, Mr. Timothy J  54.0       1         0
7                      Palsson, Master. Gosta Leonard   2.0       3         0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3         1
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0       2         1
10                    Sandstrom, Miss. Marguerite Rut   4.0       3         1

하나만 가져올때는 리스트 없어도 댐

In [92]:
df.loc[0:10,'Survived']

0     0
1     1
2     1
3     1
4     0
5     0
6     0
7     0
8     1
9     1
10    1
Name: Survived, dtype: int64

In [93]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [95]:
df.iloc[0:11,[3,5,2,1]]

                                                 Name   Age  Pclass  Survived
0                             Braund, Mr. Owen Harris  22.0       3         0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                              Heikkinen, Miss. Laina  26.0       3         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                            Allen, Mr. William Henry  35.0       3         0
5                                    Moran, Mr. James   NaN       3         0
6                             McCarthy, Mr. Timothy J  54.0       1         0
7                      Palsson, Master. Gosta Leonard   2.0       3         0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3         1
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0       2         1
10                    Sandstrom, Miss. Marguerite Rut   4.0       3         1

In [96]:
df.iloc[0:10,0:6]

,PassengerId,Survived,Pclass,Name,Sex,Age
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0
5,6,0,3,"Moran, Mr. James",male,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

In [100]:
df.iloc[0:10:2, 0:6:2]

   PassengerId  Pclass     Sex
0            1       3    male
2            3       3  female
4            5       3    male
6            7       1    male
8            9       3  female

In [102]:
df.iloc[::-1,:-1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN
...,...,...,...,...,...,...,...,...,...,...,...
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN

In [103]:
df.loc[890,'Name']

'Dooley, Mr. Patrick'

In [108]:
df.loc[890,3]='둘리'

In [109]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,3
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,NaN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,둘리

# 컬럼에서 유일값 찾기 unique(), 유일값의 개수 nunique

In [119]:
df['Pclass'].nunique()

3

# 유일값의 개수를 셀때 value_counts()

In [121]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [122]:
df['Pclass'].value_counts(sort=False)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

# 데이터를 정렬 sort_values(by='컬럼명')
* SQL의 order by 기능과 동일

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
df.sort_values(by='Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [8]:
df.sort_values(by='Age',ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [10]:
df.sort_values(by=['Age','Pclass'],ascending=False).head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S

# 컬럼을 인덱스로 지정하기
* set_index("컬럼명")

In [12]:
df.set_index(["PassengerId"])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
# 할당을 하지 않고 저장
df.set_index(["PassengerId"],inplace=True)

In [22]:
df.reset_index(drop=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [16]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

인덱스를 컬럼으로 되돌리기
* reset_index()
* 인덱스를 초기화하고 이전 인덱스를 삭제하고 싶을 때
    * reset_index(drop=True)

In [20]:
df.reset_index(inplace=True)

In [23]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 컬럼 이름 바꾸기
* rename(columns={'원래이름':'새이름1','원래이름2':'새이름2'}

In [24]:
df.rename(columns={'PassengerId':'승객언어','Embarked':'출항지'})

,승객언어,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,출항지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
df.rename(index={0:'영번',1:'일번'})

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
영번,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
일번,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 컬럼을 모두 바꾸는 방법
* df.columns = [새로운 컬럼 리스트]

In [27]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [134]:
#바로 할당
df.columns= ['승객번호','생존여부','선실등급','이름','성별','나이','형제자매수','부모자녀수','티켓번호','가격','좌석번호','출항지']

In [33]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 기존 데이터 프레임에 새로운 컬럼 추가하기
* 딕셔너리처럼 변수명['새컬럼명']=자료

In [34]:
df['가족수']=0

In [35]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

# 컬럼 삭제하기
* del df['컬럼명']
* df.drop('컬럼명',axis=1)
* df.drop(['컬럼명1', '컬럼명2'],axis=1)

In [47]:
# df=df.drop('가족수',axis)
df.drop(['가족수'], axis=1,inplace=True)

# 컬럼끼리 연산해서 새 컬럼 만들기

In [135]:
df['가족수']=df['형제자매수']+df['부모자녀수']

In [136]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [137]:
df.drop(['형제자매수','부모자녀수'],axis=1)

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0

In [44]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '형제자매수', '부모자녀수', '티켓번호',
       '가격', '좌석번호', '출항지', '가족수'],
      dtype='object')

In [45]:
drop_cols=['승객번호','이름','티켓번호','좌석번호']

In [46]:
df.drop(drop_cols,axis=1)

     생존여부  선실등급      성별    나이  형제자매수  부모자녀수       가격 출항지  가족수
0       0     3    male  22.0      1      0   7.2500   S    1
1       1     1  female  38.0      1      0  71.2833   C    1
2       1     3  female  26.0      0      0   7.9250   S    0
3       1     1  female  35.0      1      0  53.1000   S    1
4       0     3    male  35.0      0      0   8.0500   S    0
..    ...   ...     ...   ...    ...    ...      ...  ..  ...
886     0     2    male  27.0      0      0  13.0000   S    0
887     1     1  female  19.0      0      0  30.0000   S    0
888     0     3  female   NaN      1      2  23.4500   S    3
889     1     1    male  26.0      0      0  30.0000   C    0
890     0     3    male  32.0      0      0   7.7500   Q    0

[891 rows x 9 columns]

# 데이터 타입 바꾸기
* astype(자료형)
* qpply(형변환함수 int, float)
* pd.to_numeric(Series)

In [48]:
df['선실등급'].dtype

dtype('int64')

In [49]:
# 재할당 안 하면 안 바뀜
df['선실등급'].astype(str)

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: 선실등급, Length: 891, dtype: object

In [50]:
df['선실등급']=df['선실등급'].astype(str)

In [51]:
# dtype('O')는 str 타입이라는 뜻
df['선실등급'].dtype

dtype('O')

In [52]:
# 재할당 해줘야함
pd.to_numeric(df['선실등급'])

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: 선실등급, Length: 891, dtype: int64

In [53]:
df['선실등급']=pd.to_numeric(df['선실등급'])

In [54]:
# 반복문과 같은 역할
df['선실등급'].apply(str)

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: 선실등급, Length: 891, dtype: object

In [57]:
df['선실등급'].apply(lambda x : '짝수' if x %2==0 else '홀수')

0      홀수
1      홀수
2      홀수
3      홀수
4      홀수
       ..
886    짝수
887    홀수
888    홀수
889    홀수
890    홀수
Name: 선실등급, Length: 891, dtype: object

# 판다스 데이터프레임에서 조건에 맞는 행만 가져오기
* df[df['컬럼명'] 조건식]
* 조건식 연산자 >, >=, <, <=, == !=, &(and), |(or)

In [60]:
df[df['나이'] < 20]

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [61]:
# 선실등급이 3인 경우
df[df['선실등급'] ==3]

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 조건이 2개 이상 오는 경우
* df[(조건1) & (조건 2)]

In [83]:
# 여성이면서 나이가 35세 초과인 행 찾기 and 조건
df2_result=df[(df['성별'] =='female') & (df['나이']>35)]
df2_result

,index,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
11,11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,0
15,15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,0
25,25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,6
40,40,41,1,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
862,862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,0
865,865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S,0
871,871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,2
879,879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,1
885,885,886,1,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,5

In [84]:
# 성별은 male, 선실등급 1, 생존여부가 1인 사람을 찾으세요
df[(df['성별']=='male')& (df['선실등급']==1) & (df['생존여부']==1)]

,index,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
6,6,7,1,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0
23,23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,0
27,27,28,1,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,5
30,30,31,1,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C,0
34,34,35,1,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
839,839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C,0
857,857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S,0
867,867,868,1,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S,0
872,872,873,1,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,0
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0

In [89]:
# 성별은 female, 선실등급 1 or 2, 생존여부가 1인 사람을 찾으세요
result2=df[(df['성별']=='female')& ((df['선실등급']==1)|(df['선실등급']==2) )& (df['생존여부']==1)]

In [86]:
result2['선실등급'].value_counts()

선실등급
1    94
2    76
Name: count, dtype: int64

In [90]:
result2.describe()

,index,승객번호,생존여부,선실등급,나이,형제자매수,부모자녀수,가격,가족수
count,170.000000,170.000000,170.0,170.000000,159.000000,170.000000,170.000000,170.000000,170.000000
mean,456.541176,457.541176,1.0,1.447059,31.871069,0.523529,0.523529,68.503260,1.047059
std,245.383075,245.383075,0.0,0.498658,13.555467,0.654551,0.778429,69.629969,1.139977
min,1.000000,2.000000,1.0,1.000000,2.000000,0.000000,0.000000,10.500000,0.000000
25%,290.250000,291.250000,1.0,1.000000,23.000000,0.000000,0.000000,24.482300,0.000000
50%,438.500000,439.500000,1.0,1.000000,31.000000,0.000000,0.000000,49.502100,1.000000
75%,648.500000,649.500000,1.0,2.000000,40.000000,1.000000,1.000000,85.743750,2.000000
max,887.000000,888.000000,1.0,2.000000,63.000000,3.000000,3.000000,512.329200,5.000000

# 조건에 맞는 행을 찾은 후 특정 컬럼만 조회하기
* df.loc[df['컬럼명'] 조건식,"조회할 컬럼명"]

In [94]:
# 선실등급이 1이거나 2이면서 생존한 여성중에서 이름 컬럼만 보고싶을 때
df.loc[((df['선실등급']==1)|(df['선실등급']==2))&(df['생존여부']==1) & (df['성별']=='female'),"이름"]

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9                    Nasser, Mrs. Nicholas (Adele Achem)
11                              Bonnell, Miss. Elizabeth
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874                Abelson, Mrs. Samuel (Hannah Wizosky)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: 이름, Length: 170, dtype: object

In [95]:
# 선실등급이 1이고 생존한 남성중에서 이름과 나이 컬럼만 보고싶을 때
df.loc[(df['선실등급']==1)&(df['생존여부']==1) & (df['성별']=='female'),["이름","나이"]]

                                                    이름    나이
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
11                            Bonnell, Miss. Elizabeth  58.0
31      Spencer, Mrs. William Augustus (Marie Eugenie)   NaN
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)  49.0
..                                                 ...   ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  48.0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
887                       Graham, Miss. Margaret Edith  19.0

[94 rows x 2 columns]

# or 조건을 하나의 조건식으로 처리 .isin([조건1,조건2])

In [96]:
df.loc[(df['선실등급']==1).isin([1,2])&(df['생존여부']==1) & (df['성별']=='female'),"이름"]

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
11                              Bonnell, Miss. Elizabeth
31        Spencer, Mrs. William Augustus (Marie Eugenie)
52              Harper, Mrs. Henry Sleeper (Myna Haxtun)
                             ...
856           Wick, Mrs. George Dennick (Mary Hitchcock)
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
887                         Graham, Miss. Margaret Edith
Name: 이름, Length: 94, dtype: object

# 특정 단어를 포함한 행 찾기
* SQL의 like %단어%
* df['컬럼명'].str.contains("찾을 단어")

In [99]:
# 이름에 Joseph이 들어간 사람 찾기
df[df['이름'].str.contains("Joseph")]

,index,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
20,20,21,1,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S,0
34,34,35,1,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C,1
95,95,96,1,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S,0
140,140,141,1,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C,2
145,145,146,1,2,"Nicholls, Mr. Joseph Charles",male,19.0,1,1,C.A. 33112,36.7500,NaN,S,2
194,194,195,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,PC 17610,27.7208,B4,C,0
375,375,376,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,1,0,PC 17604,82.1708,NaN,C,1
454,454,455,1,3,"Peduzzi, Mr. Joseph",male,NaN,0,0,A/5 2817,8.0500,NaN,S,0
532,532,533,1,3,"Elias, Mr. Joseph Jr",male,17.0,1,1,2690,7.2292,NaN,C,2
559,559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,1,0,345572,17.4000,NaN,S,1
578,578,579,1,3,"Caram, Mrs. Joseph (Maria Elias)",female,NaN,1,0,2689,14.4583,NaN,C,1
589,589,590,1,3,"Murdlin, Mr. Joseph",male,NaN,0,0,A./5. 3235,8.0500,NaN,S,0
608,608,609,1,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,1,2,SC/Paris 2123,41.5792,NaN,C,3
685,685,686,1,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C,3
752,752,753,1,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,0,0,345780,9.5000,NaN,S,0
828,828,829,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,367228,7.7500,NaN,Q,0

# 시리즈에서 문자열 함수 사용하기

In [103]:
# 이름에서 성과 이름 분리하기
for row in df['이름'][:2]:
    last_name, first_name = row.split(", ")
    print("last name: ",last_name, "|","first name: ",first_name)

last name:  Braund | first name:  Mr. Owen Harris
last name:  Cumings | first name:  Mrs. John Bradley (Florence Briggs Thayer)

# .str.split() 시리즈의 문자열을 공백을 기준으로 나눠 리스트로 만들기

In [105]:
df['이름']=df['이름'].str.split(", ")

In [107]:
df

,index,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
0,0,1,1,3,"[Braund, Mr. Owen Harris]",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,1,2,1,1,"[Cumings, Mrs. John Bradley (Florence Briggs T...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,2,3,1,3,"[Heikkinen, Miss. Laina]",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,3,4,1,1,"[Futrelle, Mrs. Jacques Heath (Lily May Peel)]",female,35.0,1,0,113803,53.1000,C123,S,1
4,4,5,1,3,"[Allen, Mr. William Henry]",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,1,2,"[Montvila, Rev. Juozas]",male,27.0,0,0,211536,13.0000,NaN,S,0
887,887,888,1,1,"[Graham, Miss. Margaret Edith]",female,19.0,0,0,112053,30.0000,B42,S,0
888,888,889,1,3,"[Johnston, Miss. Catherine Helen ""Carrie""]",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,889,890,1,1,"[Behr, Mr. Karl Howell]",male,26.0,0,0,111369,30.0000,C148,C,0
890,890,891,1,3,"[Dooley, Mr. Patrick]",male,32.0,0,0,370376,7.7500,NaN,Q,0

# df['컬럼명'].str.join(구분자)

In [109]:
df['이름']=df['이름'].str.join(", ")

In [152]:
df[['last_name', 'first_name']] = df['이름'].str.split(", ",expand=True)

In [120]:
df

,index,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,0,1,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,4,5,1,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,1,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,888,889,1,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,890,891,1,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

# 대소문자 바꾸기 
* str.upper, str.lower

In [153]:
df["last_name"].str.upper()

0         BRAUND
1        CUMINGS
2      HEIKKINEN
3       FUTRELLE
4          ALLEN
         ...
886     MONTVILA
887       GRAHAM
888     JOHNSTON
889         BEHR
890       DOOLEY
Name: last_name, Length: 891, dtype: object

In [154]:
df['first_name'].str.lower()

0                                 mr. owen harris
1      mrs. john bradley (florence briggs thayer)
2                                     miss. laina
3              mrs. jacques heath (lily may peel)
4                               mr. william henry
                          ...
886                                   rev. juozas
887                          miss. margaret edith
888                miss. catherine helen "carrie"
889                               mr. karl howell
890                                   mr. patrick
Name: first_name, Length: 891, dtype: object

# 문자열 안에서 특정문자를 찾아서 변경
str.replace()

In [123]:
df['first_name'].str.replace("(","").str.replace(")","")

0                               Mr. Owen Harris
1      Mrs. John Bradley Florence Briggs Thayer
2                                   Miss. Laina
3              Mrs. Jacques Heath Lily May Peel
4                             Mr. William Henry
                         ...
886                                 Rev. Juozas
887                        Miss. Margaret Edith
888              Miss. Catherine Helen "Carrie"
889                             Mr. Karl Howell
890                                 Mr. Patrick
Name: first_name, Length: 891, dtype: object

# 문자열 양쪽 공백 없애기
str.strip()

In [124]:
df['first_name'].str.strip()

0                                 Mr. Owen Harris
1      Mrs. John Bradley (Florence Briggs Thayer)
2                                     Miss. Laina
3              Mrs. Jacques Heath (Lily May Peel)
4                               Mr. William Henry
                          ...
886                                   Rev. Juozas
887                          Miss. Margaret Edith
888                Miss. Catherine Helen "Carrie"
889                               Mr. Karl Howell
890                                   Mr. Patrick
Name: first_name, Length: 891, dtype: object

# 특정 기준 컬럼을 지정해서 다른 컬럼의 통계량(평균, 최소, 최대)
* groupby
* df[['보고싶은 컬럼1','보고싶은 컬럼2']].groupby('기준컬럼').집합함수(mean,max,min,median,count,value_counts(sort=False))

In [140]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '형제자매수', '부모자녀수', '티켓번호',
       '가격', '좌석번호', '출항지', '가족수'],
      dtype='object')

In [141]:
# 성별별 생존자수
df[['성별','생존여부']].groupby('성별').value_counts(sort=False)

성별      생존여부
female  0        81
        1       233
male    0       468
        1       109
Name: count, dtype: int64

In [142]:
df.groupby('성별')['생존여부'].value_counts(sort=False)

성별      생존여부
female  0        81
        1       233
male    0       468
        1       109
Name: count, dtype: int64

In [143]:
#  성별별 생존율
df[['성별','생존여부']].groupby('성별').mean()

            생존여부
성별
female  0.742038
male    0.188908

In [144]:
# 선실등급별 성별별 생존율
df[['선실등급','성별','생존여부']].groupby(['선실등급','성별']).mean()

                 생존여부
선실등급 성별
1    female  0.968085
     male    0.368852
2    female  0.921053
     male    0.157407
3    female  0.500000
     male    0.135447

In [145]:
df[['선실등급', '성별', '생존여부']].groupby(['선실등급', '성별']).describe()

              생존여부
             count      mean       std  min  25%  50%  75%  max
선실등급 성별
1    female   94.0  0.968085  0.176716  0.0  1.0  1.0  1.0  1.0
     male    122.0  0.368852  0.484484  0.0  0.0  0.0  1.0  1.0
2    female   76.0  0.921053  0.271448  0.0  1.0  1.0  1.0  1.0
     male    108.0  0.157407  0.365882  0.0  0.0  0.0  0.0  1.0
3    female  144.0  0.500000  0.501745  0.0  0.0  0.5  1.0  1.0
     male    347.0  0.135447  0.342694  0.0  0.0  0.0  0.0  1.0

# groupby후에 원하는 통계량을 모아서 볼 때 .agg([집합함수])

In [146]:
df[['선실등급', '성별', '생존여부']].groupby(['선실등급', '성별']).agg(['min', 'max', 'mean'])

            생존여부
             min max      mean
선실등급 성별
1    female    0   1  0.968085
     male      0   1  0.368852
2    female    0   1  0.921053
     male      0   1  0.157407
3    female    0   1  0.500000
     male      0   1  0.135447

# 피벗테이블 pivot

In [147]:
# 선실등급별 성별별 생존율
df.pivot_table(values='생존여부',index='성별',columns='선실등급')

선실등급           1         2         3
성별
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 결측값 찾기(값이 없는 것 NaN)
* isna(), isnull()

In [156]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   승객번호        891 non-null    int64
 1   생존여부        891 non-null    int64
 2   선실등급        891 non-null    int64
 3   이름          891 non-null    object
 4   성별          891 non-null    object
 5   나이          714 non-null    float64
 6   형제자매수       891 non-null    int64
 7   부모자녀수       891 non-null    int64
 8   티켓번호        891 non-null    object
 9   가격          891 non-null    float64
 10  좌석번호        204 non-null    object
 11  출항지         889 non-null    object
 12  가족수         891 non-null    int64
 13  last_name   891 non-null    object
 14  first_name  891 non-null    object
dtypes: float64(2), int64(6), object(7)
memory usage: 104.5+ KB

In [155]:
df.isna().sum()

승객번호            0
생존여부            0
선실등급            0
이름              0
성별              0
나이            177
형제자매수           0
부모자녀수           0
티켓번호            0
가격              0
좌석번호          687
출항지             2
가족수             0
last_name       0
first_name      0
dtype: int64

In [157]:
# 각 컬럼의 결측값의 비율 계산하기
df.isna().sum() /len(df)

승객번호          0.000000
생존여부          0.000000
선실등급          0.000000
이름            0.000000
성별            0.000000
나이            0.198653
형제자매수         0.000000
부모자녀수         0.000000
티켓번호          0.000000
가격            0.000000
좌석번호          0.771044
출항지           0.002245
가족수           0.000000
last_name     0.000000
first_name    0.000000
dtype: float64

In [159]:
df.isnull().sum()

승객번호            0
생존여부            0
선실등급            0
이름              0
성별              0
나이            177
형제자매수           0
부모자녀수           0
티켓번호            0
가격              0
좌석번호          687
출항지             2
가족수             0
last_name       0
first_name      0
dtype: int64

# 결측값이 있는 행 삭제
* dropna()

In [161]:
df.dropna()

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0,McCarthy,Mr. Timothy J
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,2,Sandstrom,Miss. Marguerite Rut
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,0,Bonnell,Miss. Elizabeth
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,2,Beckwith,Mrs. Richard Leonard (Sallie Monypeny)
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,0,Carlsson,Mr. Frans Olof
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,1,Potter,Mrs. Thomas Jr (Lily Alexenia Wilson)
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell

# 결측값을 다른 값으로 채워주는 함수
* fillna()

In [162]:
# 나이 컬럼에서 결측값이 있는 행을 필터링
df[df['나이'].isna()]

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0,Moran,Mr. James
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,0,Williams,Mr. Charles Eugene
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,0,Masselmani,Mrs. Fatima
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,0,Emir,Mr. Farred Chehab
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q,0,O'Dwyer,"Miss. Ellen ""Nellie"""
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C,0,Razi,Mr. Raihed
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,10,Sage,"Miss. Dorothy Edith ""Dolly"""
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,0,van Melkebeke,Mr. Philemon
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,0,Laleff,Mr. Kristo
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""

In [164]:
int(df['나이'].mean())

29

In [167]:
df['나이']=df['나이'].fillna(29)

In [168]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

# 여러개의 데이터프레임 합치기
## concat: 두 개 이상의 데이터 프레임을 1개로 합침
## merge: SQL의 join과 같은 역할, 공통된 기준 컬럼을 매칭해서 합침
## join: index가 같은 것끼리 합침

In [169]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb

In [178]:
engine=create_engine("mysql+pymysql://kict06:kict06@221.155.18.165:3306/titanic")
conn=engine.connect()

In [179]:
passenger=pd.read_sql("passenger",con=conn)
ticket=pd.read_sql("ticket",con=conn)
survived=pd.read_sql("surv",con=conn)
conn.close()

In [180]:
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
1,192,"Carbines, Mr. William",male,19.0,0,0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [181]:
ticket

     PassengerId         Ticket  Pclass      Fare    Cabin Embarked
0            486           4133       3   25.4667     None        S
1            119       PC 17558       1  247.5208  B58 B60        C
2            836       PC 17756       1   83.1583      E49        C
3            528       PC 17483       1  221.7792      C95        S
4            396         350052       3    7.7958     None        S
..           ...            ...     ...       ...      ...      ...
440          692         349256       3   13.4167     None        C
441          585           3411       3    8.7125     None        C
442          265         382649       3    7.7500     None        Q
443          328          28551       2   13.0000        D        S
444          136  SC/PARIS 2133       2   15.0458     None        C

[445 rows x 6 columns]

In [234]:
survived

             Survived
PassengerId
762                 0
665                 1
809                 0
332                 0
21                  0
...               ...
698                 1
778                 1
157                 1
350                 0
881                 1

[446 rows x 1 columns]

### concat으로 합치기

In [195]:
pd.concat([passenger,survived])

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1.0,0.0,NaN
1,192,"Carbines, Mr. William",male,19.0,0.0,0.0,NaN
2,715,"Greenberg, Mr. Samuel",male,52.0,0.0,0.0,NaN
3,533,"Elias, Mr. Joseph Jr",male,17.0,1.0,1.0,NaN
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1.0,0.0,NaN
...,...,...,...,...,...,...,...
441,698,NaN,NaN,NaN,NaN,NaN,1.0
442,778,NaN,NaN,NaN,NaN,NaN,1.0
443,157,NaN,NaN,NaN,NaN,NaN,1.0
444,350,NaN,NaN,NaN,NaN,NaN,0.0
445,881,NaN,NaN,NaN,NaN,NaN,1.0

In [184]:
#concat은 기본적으로 행방향으로 합침
pd.concat([ticket,survived])

,PassengerId,Ticket,Pclass,Fare,Cabin,Embarked,PassengerId,Survived
0,486.0,4133,3.0,25.4667,None,S,762,0
1,119.0,PC 17558,1.0,247.5208,B58 B60,C,665,1
2,836.0,PC 17756,1.0,83.1583,E49,C,809,0
3,528.0,PC 17483,1.0,221.7792,C95,S,332,0
4,396.0,350052,3.0,7.7958,None,S,21,0
...,...,...,...,...,...,...,...,...
441,585.0,3411,3.0,8.7125,None,C,698,1
442,265.0,382649,3.0,7.7500,None,Q,778,1
443,328.0,28551,2.0,13.0000,D,S,157,1
444,136.0,SC/PARIS 2133,2.0,15.0458,None,C,350,0
445,NaN,NaN,NaN,NaN,NaN,NaN,881,1

### merge: SQL의 조인과 아주 유사(기본 inner)

In [202]:
# select * from ticket as t left join survived as s on t.PassengerId=s.PassengerId
pd.merge(pd.merge(passenger,survived,how='inner',on='PassengerId'),ticket,how='left',on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,1,NaN,NaN,NaN,NaN,NaN
1,400,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,1,NaN,NaN,NaN,NaN,NaN
2,253,"Stead, Mr. William Thomas",male,62.0,0,0,0,NaN,NaN,NaN,NaN,NaN
3,71,"Jenkin, Mr. Stephen Curnow",male,32.0,0,0,0,NaN,NaN,NaN,NaN,NaN
4,273,"Mellinger, Mrs. (Elizabeth Anne Maidment)",female,41.0,0,1,1,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
301,346,"Brown, Miss. Amelia ""Mildred""",female,24.0,0,0,1,NaN,NaN,NaN,NaN,NaN
302,536,"Hart, Miss. Eva Miriam",female,7.0,0,2,1,NaN,NaN,NaN,NaN,NaN
303,212,"Cameron, Miss. Clear Annie",female,35.0,0,0,1,NaN,NaN,NaN,NaN,NaN
304,538,"LeRoy, Miss. Bertha",female,30.0,0,0,1,NaN,NaN,NaN,NaN,NaN
305,197,"Mernagh, Mr. Robert",male,NaN,0,0,0,NaN,NaN,NaN,NaN,NaN

### join: 기준은 데이터프레임의 index (기본 left)

In [206]:
passenger=passenger.set_index("PassengerId")

In [246]:
survived = survived.set_index("PassengerId")

In [208]:
passenger.join(survived,how='outer')

,Name,Sex,Age,SibSp,Parch,Survived
PassengerId,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,NaN
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,1.0
3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,NaN
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,NaN
5,"Allen, Mr. William Henry",male,35.0,0.0,0.0,NaN
...,...,...,...,...,...,...
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5.0,NaN
887,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,NaN
888,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,NaN
889,NaN,NaN,NaN,NaN,NaN,0.0
890,NaN,NaN,NaN,NaN,NaN,1.0

# 중복 여부 확인 및 제거하기 
* .duplicated(): 중복 확인 개수
* .drop_duplicates(): 중복 행 제거

In [211]:
df2=pd.concat([df,df,df])
df2

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [214]:
df2[df2.duplicated()]

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [216]:
# 중복의 기준 컬럼을 지정해서 중복 탐색
df2.duplicated(subset='승객번호').sum()

np.int64(1782)

In [220]:
#중복된 행 삭제
df2.drop_duplicates()

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [221]:
# 중복된 행 삭제 + 중복 기준 지정
df2.drop_duplicates(subset=['승객번호','last_name'])

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [222]:
# 중복된 행 삭제 + 중복 기준 지정+ 남길 데이터
df2.drop_duplicates(subset='승객번호',keep='last')

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [225]:
# 중복된 행 삭제 + 중복 기준 지정+ 남길 데이터
df2.drop_duplicates(subset='승객번호',keep=False)

Empty DataFrame
Columns: [승객번호, 생존여부, 선실등급, 이름, 성별, 나이, 형제자매수, 부모자녀수, 티켓번호, 가격, 좌석번호, 출항지, 가족수, last_name, first_name]
Index: []